恩，今天进行了paypal的第二轮Skype面试，也不知道是不是加面，面试官也说不清楚，整个流程下来感觉有点蛋疼，也是自己学艺不精吧。
第一轮是一个别组的人来问的，聊了一下resume里面的project，然后就花了36分钟。。。总共就45分钟好么，期间她不停根据project的结论
加条件然后问数理统计的问题，接下来的时间问一个sql的问题，没叫我写，但是也够呛，好久不用这个东西了，感觉好虚，说了思路对面觉得似乎还行
，最后超时了20分钟。第二轮是一个别的组的人来面，然后上来就做case分析，问了一下如何设定系统阈值然后怎么决断是不是set alert，
反正各种蒙各种扯，然后大姐一直和我说为啥不在本地找要找到加州来，难道这是要拒我的意思？ 面完这两轮之后已经处于一个又饿又困加上大写
的懵逼阶段。。。知道最后一轮一定是一个算法题只求简单一点。 最后一轮确实是算法类问题，但是更加像是OOD，让我设计一个musicplayer类，
然后要有shuffle功能，我一开始有好一段时间都在懵逼中，然后理解错了问题，后来在面试官的hint下磕磕绊绊（怎么一到算法题就这么磕磕绊绊了
。。。）写出来了，面试官再往上加需求，比如说要有回放功能，然后问我这个4g的内存里面1g的歌大概能放多少个回放表，我直接很脑残得回答4个
，然后面试官感觉无语问了我一下内存的问题，pointer和refer的区别，我说了之后意识到前面答错了，就改了过来，
整个流程中有两三个这样鲁莽的回答，现在回想起来感觉很蛋疼，希望面试官不要这样挂掉我。。。 总体来说，体验很不错，
三个人里面两个人和我用中文说话的。。。但是自己太sui了，没有做到完美，尤其是算法那里，懵逼得太快了，希望能过吧，也希望下面别家的OA顺利。




//-----------------------//
约面试的时候对方就说，这是 techniqual interview，但不需要在电脑前（没有coding）。。上来双方自我介绍，
然后问了我写简历上的project，什么最challenging的是什么啊。 然后问我 java的基本概念。他们有时会做debug、
QA类的工作，问我 如何快速查找文件之类的，我说用 linux的 grep command，还有正则表达式。最后居然出了道小的系统设计题，
设计 汽车，sedan car, SUV, compact car，motor cycle的，如何用继承啊什么的。我当时有点懵了，乱说了一通。继承很简单嘛。
但我发散思维不强，汽车需要哪些behavior，不同车method又有什么不同？反正我答得时候晕晕的。。。



